#!/usr/bin/env python3

# задача 02
"""
Вывести на экран ряд чисел 1001,  1004,  1007,  ... 1025.
"""
for i in range(1001, 1026, 3):
    print(i, end=' ')
